from unittest.mock import patch

import numpy as np
import pytest
from pandas import Timestamp

from src.views import (
    API_KEY,
    API_KEY_CR,
    data_select,
    get_cards,
    get_currency,
    get_stock,
    get_top_transactions,
    greeting_generate,
)


@pytest.mark.parametrize(
    "data_input, response, result",
    [
        (
            "USD",
            {
                "success": True,
                "query": {"from": "USD", "to": "RUB", "amount": 1},
                "info": {"timestamp": 1756205828, "rate": 80.444792},
                "date": "2025-08-26",
                "result": 80.444792,
            },
            {"currency": "USD", "rate": 80.444792},
        ),
        (
            "EUR",
            {
                "success": True,
                "query": {"from": "EUR", "to": "RUB", "amount": 1},
                "info": {"timestamp": 1756206665, "rate": 93.706543},
                "date": "2025-08-26",
                "result": 93.706543,
            },
            {"currency": "EUR", "rate": 93.706543},
        ),
    ],
)
@patch("requests.get")
def test_get_currency(mock_get, data_input, response, result):
    mock_get.return_value.json.return_value = response
    assert get_currency(data_input) == result
    mock_get.assert_called_once_with(
        "https://api.apilayer.com/exchangerates_data/convert",
        {"to": "RUB", "from": data_input, "amount": 1},
        headers={"apikey": API_KEY_CR},
    )


@pytest.mark.parametrize(
    "data_input, response, result",
    [
        (
            "AAPL",
            {
                "Global Quote": {
                    "01. symbol": "AAPL",
                    "02. open": "226.4800",
                    "03. high": "229.3000",
                    "04. low": "226.2300",
                    "05. price": "227.1600",
                    "06. volume": "30983133",
                    "07. latest trading day": "2025-08-25",
                    "08. previous close": "227.7600",
                    "09. change": "-0.6000",
                    "10. change percent": "-0.2634%",
                }
            },
            {"stock": "AAPL", "price": "227.1600"},
        ),
        (
            "GOOGL",
            {
                "Global Quote": {
                    "01. symbol": "GOOGL",
                    "02. open": "206.4300",
                    "03. high": "210.5200",
                    "04. low": "205.2800",
                    "05. price": "208.4900",
                    "06. volume": "29928878",
                    "07. latest trading day": "2025-08-25",
                    "08. previous close": "206.0900",
                    "09. change": "2.4000",
                    "10. change percent": "1.1645%",
                }
            },
            {"stock": "GOOGL", "price": "208.4900"},
        ),
    ],
)
@patch("requests.get")
def test_get_stock(mock_get, data_input, response, result):
    mock_get.return_value.json.return_value = response
    assert get_stock(data_input) == result
    mock_get.assert_called_once_with(
        "https://www.alphavantage.co/query", {"function": "GLOBAL_QUOTE", "symbol": data_input, "apikey": API_KEY}
    )


@pytest.mark.parametrize(
    "data_input, response, result",
    [
        (
            "AAPL",
            {"ERROR"},
            {},
        ),
    ],
)
@patch("requests.get")
def test_get_stock_err(mock_get, data_input, response, result):
    mock_get.return_value.json.return_value = response
    assert get_stock(data_input) == result
    mock_get.assert_called_once_with(
        "https://www.alphavantage.co/query", {"function": "GLOBAL_QUOTE", "symbol": data_input, "apikey": API_KEY}
    )


@pytest.fixture
def data_load():
    return [
        {
            "Дата операции": "2020.07.17 12:12:48",
            "Дата платежа": "07.07.2020",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": 6700.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 6700.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Пополнения",
            "MCC": 0,
            "Описание": "Тинькофф",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 6700.0,
        },
        {
            "Дата операции": "2020.07.06 17:53:17",
            "Дата платежа": "07.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1090.6,
            "Валюта операции": "RUB",
            "Сумма платежа": -1090.6,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Другое",
            "MCC": 4900.0,
            "Описание": "Петроэлектросбыт",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 1090.6,
        },
        {
            "Дата операции": "2020.07.06 14:29:32",
            "Дата платежа": "08.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -334.36,
            "Валюта операции": "RUB",
            "Сумма платежа": -334.36,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Магнит",
            "Бонусы (включая кэшбэк)": 6,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 334.36,
        },
        {
            "Дата операции": "2020.07.06 14:19:11",
            "Дата платежа": "08.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -120.8,
            "Валюта операции": "RUB",
            "Сумма платежа": -120.8,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Колхоз",
            "Бонусы (включая кэшбэк)": 2,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 120.8,
        },
        {
            "Дата операции": "2020.07.05 17:11:51",
            "Дата платежа": "05.07.2020",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": 300.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 300.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Переводы",
            "MCC": 0,
            "Описание": "Артем П.",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 300.0,
        },
        {
            "Дата операции": "2020.07.05 15:05:55",
            "Дата платежа": "07.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -159.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -159.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Топливо",
            "MCC": 5541.0,
            "Описание": "Circle K",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 159.0,
        },
        {
            "Дата операции": "2020.07.04 12:15:56",
            "Дата платежа": "05.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -250.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -250.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Связь",
            "MCC": 4814.0,
            "Описание": "МТС",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 250.0,
        },
        {
            "Дата операции": "2020.07.03 16:19:52",
            "Дата платежа": "05.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -59.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -59.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Дом и ремонт",
            "MCC": 5211.0,
            "Описание": "Strojsam",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 59.0,
        },
        {
            "Дата операции": "2020.07.02 19:11:06",
            "Дата платежа": "04.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -159.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -159.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Топливо",
            "MCC": 5541.0,
            "Описание": "Circle K",
            "Бонусы (включая кэшбэк)": 3,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 159.0,
        },
        {
            "Дата операции": "2020.07.01 16:05:07",
            "Дата платежа": "04.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -34.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -34.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Magazin 25",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 34.0,
        },
        {
            "Дата операции": "2020.07.01 11:27:18",
            "Дата платежа": "03.07.2020",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -71.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -71.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": 0,
            "Категория": "Супермаркеты",
            "MCC": 5499.0,
            "Описание": "Magazin 25",
            "Бонусы (включая кэшбэк)": 1,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 71.0,
        },
    ]


@pytest.mark.parametrize(
    "time_param, result",
    [
        (
            "2020.07.03 20:00:02",
            [
                {
                    "Дата операции": Timestamp("2020.07.03 16:19:52"),
                    "Дата платежа": "05.07.2020",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -59.0,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -59.0,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": 0,
                    "Категория": "Дом и ремонт",
                    "MCC": 5211.0,
                    "Описание": "Strojsam",
                    "Бонусы (включая кэшбэк)": 1,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 59.0,
                },
                {
                    "Дата операции": Timestamp("2020.07.02 19:11:06"),
                    "Дата платежа": "04.07.2020",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -159.0,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -159.0,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": 0,
                    "Категория": "Топливо",
                    "MCC": 5541.0,
                    "Описание": "Circle K",
                    "Бонусы (включая кэшбэк)": 3,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 159.0,
                },
                {
                    "Дата операции": Timestamp("2020-07-01 16:05:07"),
                    "Дата платежа": "04.07.2020",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -34.0,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -34.0,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": 0,
                    "Категория": "Супермаркеты",
                    "MCC": 5499.0,
                    "Описание": "Magazin 25",
                    "Бонусы (включая кэшбэк)": 0,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 34.0,
                },
                {
                    "Дата операции": Timestamp("2020.07.01 11:27:18"),
                    "Дата платежа": "03.07.2020",
                    "Номер карты": "*7197",
                    "Статус": "OK",
                    "Сумма операции": -71.0,
                    "Валюта операции": "RUB",
                    "Сумма платежа": -71.0,
                    "Валюта платежа": "RUB",
                    "Кэшбэк": 0,
                    "Категория": "Супермаркеты",
                    "MCC": 5499.0,
                    "Описание": "Magazin 25",
                    "Бонусы (включая кэшбэк)": 1,
                    "Округление на инвесткопилку": 0,
                    "Сумма операции с округлением": 71.0,
                },
            ],
        ),
    ],
)
def test_data_select(data_load, time_param, result):
    assert data_select(data_load, time_param) == result


@pytest.mark.parametrize(
    "hour_in, result",
    [
        (3, "Доброй ночи"),
        (7, "Доброе утро"),
        (14, "Добрый день"),
        (18, "Добрый вечер"),
    ],
)
def test_greeting_generate(hour_in, result):
    assert greeting_generate(hour_in) == result


@pytest.fixture
def cards_list():
    return [
        {"last_digits": "4556", "total_spent": np.float64(7000.0), "cashback": np.float64(70.0)},
        {"last_digits": "7197", "total_spent": np.float64(-2277.76), "cashback": np.float64(-22.78)},
    ]


def test_get_cards(data_load, cards_list):
    assert get_cards(data_load) == cards_list


@pytest.fixture
def top_transactions():
    return [
        {"date": "07.07.2020", "amount": 6700.0, "category": "Пополнения", "description": "Тинькофф"},
        {"date": "07.07.2020", "amount": -1090.6, "category": "Другое", "description": "Петроэлектросбыт"},
        {"date": "08.07.2020", "amount": -334.36, "category": "Супермаркеты", "description": "Магнит"},
        {"date": "05.07.2020", "amount": 300.0, "category": "Переводы", "description": "Артем П."},
        {"date": "05.07.2020", "amount": -250.0, "category": "Связь", "description": "МТС"},
    ]


def test_get_top_transactions(data_load, top_transactions):
    assert get_top_transactions(data_load) == top_transactions
